{
    "projects": [
        {
            "title": "Fishbowl CMBox",
            "skills": ["Full-Stack", "Astro", "Svelte", "Typescript", "Tailwind CSS", "GraphQL", "Node", "Docker", "Redis", "GPT", "RAG", "Express", "UX Design", "API Design"],
            "description": "Developing an asset management platform for storing curated content and a flexible site builder for creating and displaying user-generated websites. Designed for performance and ease of use, the solution optimized content delivery while enabling seamless site customization.",
            "blog": "https://fishbowlsolutions.com/category/cm-box/"
        },
        {
            "title": "React based site for a State Government Entity",
            "skills": ["Front-end", "React", "Knockout", "Bootstrap", "GraphQL", "REST API", "Figma"],
            "description": "Developed and enhanced a website in collaboration with a state government to support local businesses. The platform was designed for accessibility and ease of use, providing a seamless experience for users while integrating dynamic content and robust data retrieval."
        },
        {
            "title": "Application Enhancements for a City Government Entity",
            "skills": ["Full-Stack", "Java", "JavaScript ", "Oracle Database", "HTML", "Azure"],
            "description": "Enhanced a municipal website that enables residents to apply for electric services, streamlining the application process for both users and city employees. Tasks included refining the user experience, implementing new form options to enhance submissions, and optimizing backend processes to improve workflow efficiency."
        },
        {
            "title": "React based site for a Marketing Company ",
            "skills": ["Front-end", "React", "SCSS", "GraphQL"],
            "description": "Creating a website for a marketing company, leveraging SCSS and GraphQL to deliver a performant and user-friendly experience. The focus was on developing dynamic content management features and optimizing site performance for both technical and non-technical users."
        },
        {
            "title": "Document Migration for a Tool Manufacturing Company",
            "skills": ["Back-end", "Java", "Microsoft SQL Server", "Cloud SSO Configuration"],
            "description": "This project involved designing and implementing a backend solution to migrate and organize archived documents for a tool manufacturing company. The goal was to transition files from an outdated system to a new Oracle WebCenter Content instance while optimizing the import and sorting process. Set up single sign on with Microsoft Entra"
        }
    ]
}